# HasValue Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCAnyHandle..::..HasValue Property
IFCAnyHandle Class See Also
---
Identifies if the handle is empty or contains a value.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public bool HasValue { get; }
```

Visual Basic
---
```text
Public ReadOnly Property HasValue As Boolean
	Get
```

Visual C++
---
```text
public:
property bool HasValue {
	bool get ();
}
```

# See Also
IFCAnyHandle Class
Autodesk.Revit.DB.IFC Namespace